aheadtest/4.19.13_native/fio_1Mread1.log
test: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=25414: Thu Nov  5 17:14:39 2020
   read: IOPS=107, BW=107MiB/s (113MB/s)(62.9GiB/600133msec)
    clat (usec): min=218, max=3643.7k, avg=9262.49, stdev=57546.92
     lat (usec): min=219, max=3643.7k, avg=9264.42, stdev=57546.94
    clat percentiles (usec):
     |  1.00th=[    289],  5.00th=[    318], 10.00th=[    330],
     | 20.00th=[    338], 30.00th=[    347], 40.00th=[    355],
     | 50.00th=[    367], 60.00th=[    379], 70.00th=[    400],
     | 80.00th=[    429], 90.00th=[    502], 95.00th=[  36439],
     | 99.00th=[ 225444], 99.50th=[ 341836], 99.90th=[ 725615],
     | 99.95th=[ 994051], 99.99th=[1535116]
   bw (  KiB/s): min= 2043, max=2691072, per=100.00%, avg=121181.71, stdev=325785.25, samples=1088
   iops        : min=    1, max= 2628, avg=118.25, stdev=318.16, samples=1088
  lat (usec)   : 250=0.13%, 500=89.84%, 750=3.17%, 1000=0.04%
  lat (msec)   : 2=0.05%, 4=0.11%, 10=0.35%, 20=0.56%, 50=1.30%
  lat (msec)   : 100=1.61%, 250=2.04%, 500=0.56%, 750=0.15%, 1000=0.05%
  cpu          : usr=0.07%, sys=7.60%, ctx=83948, majf=0, minf=2398
  IO depths    : 1=100.3%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=64389,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=107MiB/s (113MB/s), 107MiB/s-107MiB/s (113MB/s-113MB/s), io=62.9GiB (67.5GB), run=600133-600133msec