aheadtest/4.19.13_native/fio_4Kread1.log
test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=25106: Thu Nov  5 17:04:23 2020
   read: IOPS=28.4k, BW=111MiB/s (116MB/s)(64.0GiB/600225msec)
    clat (nsec): min=628, max=3502.8M, avg=29353.48, stdev=3701828.34
     lat (nsec): min=1816, max=3502.8M, avg=30698.97, stdev=3701829.44
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[    6], 99.50th=[   12], 99.90th=[   36], 99.95th=[   68],
     | 99.99th=[53740]
   bw (  KiB/s): min=  894, max=605940, per=100.00%, avg=129776.61, stdev=166524.07, samples=1050
   iops        : min=  223, max=151485, avg=32444.10, stdev=41631.03, samples=1050
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=1.00%, 4=93.90%, 10=4.55%, 20=0.36%, 50=0.12%
  lat (usec)   : 100=0.05%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=5.56%, sys=22.39%, ctx=111301, majf=0, minf=227
  IO depths    : 1=100.3%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=17037556,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=111MiB/s (116MB/s), 111MiB/s-111MiB/s (116MB/s-116MB/s), io=64.0GiB (69.8GB), run=600225-600225msec